In [1]:
# Database Interaction and Data Manipulation in Python
# -----------------------------------------------------------------------
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

# Path Configuration for Custom Module Imports
# -----------------------------------------------------------------------
import sys
sys.path.append('../')  # Adds the parent directory to the path for custom module imports

# Importing Custom Functions
from src.support_db import sql_query
from src.support_queries import *

# Suppressing Warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings('ignore')

Géneros por puntuación

In [2]:
df_1 = pd.DataFrame(sql_query(query_1))
df_1.columns = ['genre', 'mean_score']

Query performed successfully.
Database connection closed.

In [3]:
df_1

      genre  mean_score
0     Drama    6.075712
1    Comedy    6.017066
2   Mystery    5.936039
3   Fantasy    5.854348
4   Romance    5.782730
5  Thriller    5.698652
6    Action    5.690998
7    Horror    5.401922

Géneros por oscars

In [4]:
df_2 = pd.DataFrame(sql_query(query_2))
df_2.columns = ['genre', 'oscars']

Query performed successfully.
Database connection closed.

In [5]:
df_2

      genre  oscars
0     Drama    5593
1    Comedy    4056
2  Thriller    2805
3    Horror    2444
4    Action    2075
5   Romance    1877
6   Mystery    1264
7   Fantasy     504

Géneros por nominaciones

In [6]:
df_3 = pd.DataFrame(sql_query(query_3))
df_3.columns = ['genre', 'nominations']

Query performed successfully.
Database connection closed.

In [7]:
df_3

      genre  nominations
0     Drama         8270
1    Comedy         6706
2  Thriller         4599
3    Horror         4005
4   Romance         3145
5    Action         2813
6   Mystery         1903
7   Fantasy         1012

Actores con más premios

In [12]:
df_4 = pd.DataFrame(sql_query(query_4))
df_4.columns = ['actor', 'wins']

Query performed successfully.
Database connection closed.

In [13]:
df_4

                  actor  wins
0      Amitabh Bachchan   400
1              Mohanlal   216
2            Diane Farr   213
3        Akshaye Khanna   210
4           Anupam Kher   208
...                 ...   ...
9901       Denis Heames     0
9902     Thomas Carlund     0
9903       Darren Moore     0
9904  Deborah Oettinger     0
9905        Gerald Crum     0

[9906 rows x 2 columns]